#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.test.module.gke.data.google_compute_zones.available: Reading...
module.test.data.google_client_config.default: Reading...
module.test.module.gke.data.google_container_engine_versions.region: Reading...
module.test.data.google_client_config.default: Read complete after 0s [id=projects/cq-provider-gcp/regions/us-east1/zones/]
module.test.module.gke.data.google_container_engine_versions.region: Read complete after 0s [id=2022-05-23 13:53:41.779225205 +0000 UTC]
module.test.module.gke.data.google_compute_zones.available: Read complete after 0s [id=projects/cq-provider-gcp/regions/us-east1]
module.test.module.gke.data.google_container_engine_versions.zone: Reading...
module.test.module.gke.data.google_container_engine_versions.zone: Read complete after 0s [id=2022-05-23 13:53:42.016239307 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.test.google_service_account.example will be created
  + resource "google_service_account" "example" {
      + account_id   = "cq-example-gke-service-account"
      + disabled     = false
      + display_name = "cq-example-gke-service-account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cq-provider-gcp"
      + unique_id    = (known after apply)
    }

  # module.test.module.gke.data.google_compute_subnetwork.gke_subnetwork[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_subnetwork" "gke_subnetwork" {
      + description              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = (known after apply)
      + name                     = (known after apply)
      + network                  = (known after apply)
      + private_ip_google_access = (known after apply)
      + project                  = "cq-provider-gcp"
      + region                   = "us-east1"
      + secondary_ip_range       = (known after apply)
      + self_link                = (known after apply)
    }

  # module.test.module.gke.google_compute_firewall.intra_egress[0] will be created
  + resource "google_compute_firewall" "intra_egress" {
      + creation_timestamp = (known after apply)
      + description        = "Managed by terraform gke module: Allow pods to communicate with each other and the master"
      + destination_ranges = (known after apply)
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-cq-example-gke-cluster-intra-cluster-egress"
      + network            = "cq-example-gke-cluster-network"
      + priority           = 1000
      + project            = "cq-provider-gcp"
      + self_link          = (known after apply)
      + target_tags        = [
          + "gke-cq-example-gke-cluster",
        ]

      + allow {
          + ports    = []
          + protocol = "ah"
        }
      + allow {
          + ports    = []
          + protocol = "esp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
      + allow {
          + ports    = []
          + protocol = "sctp"
        }
      + allow {
          + ports    = []
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # module.test.module.gke.google_compute_firewall.master_webhooks[0] will be created
  + resource "google_compute_firewall" "master_webhooks" {
      + creation_timestamp = (known after apply)
      + description        = "Managed by terraform gke module: Allow master to hit pods for admission controllers/webhooks"
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-cq-example-gke-cluster-webhooks"
      + network            = "cq-example-gke-cluster-network"
      + priority           = 1000
      + project            = "cq-provider-gcp"
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "gke-cq-example-gke-cluster",
        ]

      + allow {
          + ports    = [
              + "9443",
              + "15017",
            ]
          + protocol = "tcp"
        }
    }

  # module.test.module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "us-east1"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + min_master_version          = "1.23.6-gke.1500"
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "cq-example-gke-cluster"
      + network                     = "projects/cq-provider-gcp/global/networks/cq-example-gke-cluster-network"
      + networking_mode             = (known after apply)
      + node_locations              = [
          + "us-east1-c",
        ]
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "cq-provider-gcp"
      + remove_default_node_pool    = false
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = false
            }

          + horizontal_pod_autoscaling {
              + disabled = false
            }

          + http_load_balancing {
              + disabled = true
            }

          + network_policy_config {
              + disabled = true
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = false

          + auto_provisioning_defaults {
              + image_type      = (known after apply)
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + state = "DECRYPTED"
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "cq-example-gke-cluster-ip-range-pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "cq-example-gke-cluster-ip-range-svc"
        }

      + logging_config {
          + enable_components = (known after apply)
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + monitoring_config {
          + enable_components = (known after apply)
        }

      + network_policy {
          + enabled = false
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + node_group        = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + gcfs_config {
              + enabled = (known after apply)
            }

          + gvnic {
              + enabled = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count          = 0
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = "default-pool"
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = "COS_CONTAINERD"
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = "e2-micro"
              + metadata          = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = false
              + service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com"
              + tags              = [
                  + "gke-cq-example-gke-cluster",
                  + "gke-cq-example-gke-cluster-default-pool",
                ]
              + taint             = (known after apply)

              + gcfs_config {
                  + enabled = false
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }

              + workload_metadata_config {
                  + mode = "GKE_METADATA"
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + vertical_pod_autoscaling {
          + enabled = false
        }

      + workload_identity_config {
          + workload_pool = "cq-provider-gcp.svc.id.goog"
        }
    }

  # module.test.module.gke.google_container_node_pool.pools["cq-example-gke-pool-1"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster                     = "cq-example-gke-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "cq-example-gke-pool-1"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "cq-provider-gcp"
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 1
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 10
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS_CONTAINERD"
          + labels            = {
              + "cluster_name" = "cq-example-gke-cluster"
              + "node_pool"    = "cq-example-gke-pool-1"
            }
          + local_ssd_count   = 0
          + machine_type      = "e2-micro"
          + metadata          = {
              + "cluster_name"             = "cq-example-gke-cluster"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "cq-example-gke-pool-1"
            }
          + oauth_scopes      = (known after apply)
          + preemptible       = true
          + service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com"
          + tags              = [
              + "gke-cq-example-gke-cluster",
              + "gke-cq-example-gke-cluster-cq-example-gke-pool-1",
            ]
          + taint             = (known after apply)

          + gcfs_config {
              + enabled = false
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.test.module.gke.google_container_node_pool.pools["default-node-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster                     = "cq-example-gke-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "default-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = [
          + "us-east1-b",
          + "us-east1-c",
        ]
      + operation                   = (known after apply)
      + project                     = "cq-provider-gcp"
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 2
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 10
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS_CONTAINERD"
          + labels            = {
              + "cluster_name"      = "cq-example-gke-cluster"
              + "default-node-pool" = "true"
              + "node_pool"         = "default-node-pool"
            }
          + local_ssd_count   = 0
          + machine_type      = "e2-micro"
          + metadata          = {
              + "cluster_name"                    = "cq-example-gke-cluster"
              + "disable-legacy-endpoints"        = "true"
              + "node-pool-metadata-custom-value" = "my-node-pool"
              + "node_pool"                       = "default-node-pool"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com"
          + tags              = [
              + "gke-cq-example-gke-cluster",
              + "gke-cq-example-gke-cluster-default-node-pool",
              + "default-node-pool",
            ]
          + taint             = [
              + {
                  + effect = "PREFER_NO_SCHEDULE"
                  + key    = "default-node-pool"
                  + value  = "true"
                },
            ]

          + gcfs_config {
              + enabled = false
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-log_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cq-provider-gcp"
      + role    = "roles/logging.logWriter"
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-metric_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cq-provider-gcp"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cq-provider-gcp"
      + role    = "roles/monitoring.viewer"
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cq-provider-gcp"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.test.module.gke.google_service_account.cluster_service_account[0] will be created
  + resource "google_service_account" "cluster_service_account" {
      + account_id   = (known after apply)
      + disabled     = false
      + display_name = "Terraform-managed service account for cluster cq-example-gke-cluster"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cq-provider-gcp"
      + unique_id    = (known after apply)
    }

  # module.test.module.gke.random_shuffle.available_zones will be created
  + resource "random_shuffle" "available_zones" {
      + id           = (known after apply)
      + input        = [
          + "us-east1-b",
          + "us-east1-c",
          + "us-east1-d",
        ]
      + result       = (known after apply)
      + result_count = 3
    }

  # module.test.module.gke.random_string.cluster_service_account_suffix will be created
  + resource "random_string" "cluster_service_account_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-master-subnet"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.60.0.0/17"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "cq-example-gke-cluster-master-subnet"
      + network                    = "cq-example-gke-cluster-network"
      + private_ip_google_access   = false
      + private_ipv6_google_access = (known after apply)
      + project                    = "cq-provider-gcp"
      + purpose                    = (known after apply)
      + region                     = "us-east1"
      + secondary_ip_range         = []
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-subnet"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.0.0.0/17"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "cq-example-gke-cluster-subnet"
      + network                    = "cq-example-gke-cluster-network"
      + private_ip_google_access   = false
      + private_ipv6_google_access = (known after apply)
      + project                    = "cq-provider-gcp"
      + purpose                    = (known after apply)
      + region                     = "us-east1"
      + secondary_ip_range         = [
          + {
              + ip_cidr_range = "192.168.0.0/18"
              + range_name    = "cq-example-gke-cluster-ip-range-pods"
            },
          + {
              + ip_cidr_range = "192.168.64.0/18"
              + range_name    = "cq-example-gke-cluster-ip-range-svc"
            },
        ]
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.test.module.gcp-network.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "cq-example-gke-cluster-network"
      + project                         = "cq-provider-gcp"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @erezrokah, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*